[
  {
    "dateTime": "Jun 5 at 2:20 PM",
    "username": "ghiblikerry",
    "likes": "3",
    "comment": "We are replacing a 2006 Mini S. It will be fun to compare!"
  },
  {
    "dateTime": "Jun 5 at 2:13 PM",
    "username": "Rodeo",
    "likes": "10,809",
    "comment": "Congrats @ghiblikerry! Great car for cheap money, what’s better than that? 😎"
  },
  {
    "dateTime": "Jun 5 at 2:08 PM",
    "username": "M3moogle",
    "likes": "34",
    "comment": "Well that was weird my phone never updated, I guess the refresh part reminder"
  },
  {
    "dateTime": "Jun 5 at 2:08 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "We’re incredibly appreciative of all the comments and bids for this auction. Rarecars will present more distinctive vehicles for sale in the coming days and weeks. Be sure to check back for these exciting opportunities.\n\nThanks to everyone!\nJake and the Rarecars Team"
  },
  {
    "dateTime": "Jun 5 at 2:08 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Hi @ghiblikerry congratulations on placing the winning bid! You’ve won an outstanding Fiat 500 Abarth; we’ll contact you soon to finalize the transaction.\n\nWe greatly appreciate your purchase"
  },
  {
    "dateTime": "Jun 5 at 2:07 PM",
    "username": "REMill0094",
    "likes": "543",
    "comment": "Good buy for sure!"
  },
  {
    "dateTime": "Jun 5 at 2:07 PM",
    "bidPrice": "Sold on 6/5/23 for $14,000 to ghiblikerry"
  },
  {
    "dateTime": "Jun 5 at 2:05 PM",
    "bidPrice": "$14,000 bid placed by ghiblikerry"
  },
  {
    "dateTime": "Jun 5 at 2:05 PM",
    "bidPrice": "$13,750 bid placed by M3moogle"
  },
  {
    "dateTime": "Jun 5 at 2:04 PM",
    "bidPrice": "$13,500 bid placed by Rednecklotus"
  },
  {
    "dateTime": "Jun 5 at 1:54 PM",
    "bidPrice": "$13,250 bid placed by ghiblikerry"
  },
  {
    "dateTime": "Jun 5 at 1:45 PM",
    "username": "Jkbenn02",
    "likes": "41",
    "comment": "I’ve had 2 Abarths and they have been very reliable. My brother liked mine enough that he bought one too. Great cars and I’ll second (or 3rd) the “smiles per dollar” comments. Always a fun trip in these Abarths! Good luck with the sale!\n\nParts have NEVER been an issue, especially powertrain-wise."
  },
  {
    "dateTime": "Jun 5 at 1:09 PM",
    "bidPrice": "$13,000 bid placed by caliautobahn"
  },
  {
    "dateTime": "Jun 5 at 1:05 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Last Call! Only Minutes Remain To Bid!\n\nThe final moments are upon us to bid on this Fiat 500 Abarth. This notable Abarth is ready for weekend adventures and daily driver duties and will be a cherished vehicle for years ahead. Proper maintenance and care will help preserve the value of this tiny but mighty Fiat.\nThis is also the time to thank everyone for participating in this auction. From the bids to the comments, we greatly appreciate everyone’s involvement in the auction. It’s been an exciting week, and we hope to see everyone soon for another Rarecars auction on BAT.\n\nAs the auction winds down, be sure to REFRESH YOUR SCREEN (computer or phone) to keep the countdown clock in sync and not miss out on any action. In addition, the timer will reset to two minutes of remaining time if a last-minute bid is placed.\n\nThanks for your interest and participation!"
  },
  {
    "dateTime": "Jun 5 at 12:30 PM",
    "bidPrice": "$12,000 bid placed by Tooltime46"
  },
  {
    "dateTime": "Jun 5 at 11:26 AM",
    "bidPrice": "$11,750 bid placed by Mapmoney"
  },
  {
    "dateTime": "Jun 5 at 10:53 AM",
    "username": "JacquesPlante2",
    "likes": "19",
    "comment": "@jojomort I’ve owned mine for 9 years and never had a problem with parts or service support. Many Fiat Studios closed, but if they were partnered with Alfa or other FCA divisions, you shouldn’t have a problem. It’s also not a terribly complex build, considering what’s out there these days."
  },
  {
    "dateTime": "Jun 5 at 10:34 AM",
    "username": "Rodeo",
    "likes": "10,809",
    "comment": "Bought a POP Sport when they first came out (2012?), only because the Abarth was not yet available. A couple years later got a 13 Abarth C that I still have.\n\nOld tropes die hard. This is NOT the Fiat of yesteryear (which I also had), it is a modern FCA product with great quality control, nice fit and finish, and solid reliability. The only issue I had with either FCA Fiat was the separation of the side skirts on the Abarth, as noted below. Took a couple tries, but eventually fixed under warranty."
  },
  {
    "dateTime": "Jun 5 at 10:18 AM",
    "username": "REMill0094",
    "likes": "543",
    "comment": "I mean to say these are NOT the Fiats from the 70s."
  },
  {
    "dateTime": "Jun 5 at 9:55 AM",
    "username": "pengel",
    "likes": "4",
    "comment": "I’ll add on to the comments about reliability. Bought a ’13 Abarth about three years ago, and have had only a few minor issues. Plus, it’s a really easy car to work on yourself and parts are easy to come by. It’s an unbelievably fun car to drive – smiles per dollar ratio is off the charts. I also have a 911, and this thing is more fun to drive at legal speeds."
  },
  {
    "dateTime": "Jun 4 at 9:20 PM",
    "username": "dparnas",
    "likes": "451",
    "comment": "Agreed. I have a 2013 500 Abarth Cabrio bought new. Zero issues with it, other than the side skirts separating, which is a known defect and the dealers took care of it under warranty, even after the mileage warranty had expired. More reliable than the 3 Audis I’ve owned over the last 20 years, which all cost twice as much as the Fiat."
  },
  {
    "dateTime": "Jun 4 at 9:09 PM",
    "username": "Citabria98",
    "likes": "4,339",
    "comment": "@Jojomort I beg to differ. Initially, these Fiats were touted to be lousy, especially by publications like Consumer Reports” et al. I never paid much attention to their opinions. In this case, the Fiat 500 has turned out to be a pretty good car."
  },
  {
    "dateTime": "Jun 4 at 6:21 PM",
    "username": "REMill0094",
    "likes": "543",
    "comment": "@Jojomort Do you know that from experience? I have two very high mileage Abarths (one that I bought new in 2013). Other than normal wear items, I’ve had no problems quite frankly. These are the Fiats from the 70s."
  },
  {
    "dateTime": "Jun 4 at 4:22 PM",
    "username": "joeyesmen",
    "likes": "1",
    "comment": "Quietest Abarth I’ve ever heard. Mine’s twice as loud."
  },
  {
    "dateTime": "Jun 4 at 3:10 PM",
    "username": "Harrington",
    "likes": "55",
    "comment": "We have a 2012 Fiat 500 Pop with over 200,000 miles and believe it or not it’s very reliable and cheap to own. I’d love an Abarth."
  },
  {
    "dateTime": "Jun 4 at 2:42 AM",
    "bidPrice": "$11,500 bid placed by Tooltime46"
  },
  {
    "dateTime": "Jun 3 at 8:17 PM",
    "username": "Jojomort",
    "likes": "16",
    "comment": "biggest concern here is the support and parts. Fiat is not the most reliable and cheaply built"
  },
  {
    "dateTime": "Jun 3 at 6:35 PM",
    "bidPrice": "$11,000 bid placed by italjob"
  },
  {
    "dateTime": "Jun 3 at 2:13 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Rarecars is happy to help coordinate the nationwide shipping of your new car. Please visit our transportation webpage at http://www.rarecars.com/shipping for a best-rate shipping quote from our transport partner.\nAlternatively, Rarecars can arrange no-fuss shipping not to exceed $1,500 for open-trailer transportation anywhere within the contiguous 48 states. Enclosed shipping won’t top $2,000 for the same delivery area.\n\nMost of our buyers have found that shipping is more cost-efficient and less time-consuming than making a special trip to pick up their new car.\n\nIf you plan to pick up the vehicle in person, by the California DMV law, we must collect a 9% sales tax. As such, Rarecars cannot provide a temporary permit to out-of-state buyers. The buyers don’t pay CA sales tax if they arrange a shipment, bring a trailer, or get a temporary permit from their state to drive the vehicle out of California.\n\nWe’re here to answer your questions!"
  },
  {
    "dateTime": "Jun 1 at 4:04 PM",
    "bidPrice": "$10,000 bid placed by Tooltime46"
  },
  {
    "dateTime": "Jun 1 at 2:49 PM",
    "bidPrice": "$8,500 bid placed by barndt"
  },
  {
    "dateTime": "Jun 1 at 1:57 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Rarecars wants you to bid confidently; and encourages a review of our previous Bring a Trailer sales (click on the Rarecars username in red). You’ll quickly see that we specialize in noteworthy vehicles and proudly serve the next owners of these rare cars. Everyone on the Rarecars team lives and breathes automobiles; we share this passion through BAT.\nIt’s a dedication that includes providing comprehensive listings enhanced with detailed information, photographs, and videos. Our solid reputation comes from being transparent and forthcoming. We’ll share the specifics in the listing if we notice something during our pre-auction multi-point inspection and test drive. We’re here to be upfront, an approach that serves everyone.\nImportantly, Rarecars owns every vehicle that we list for sale. There are no consignments or third parties! Putting our name behind every car ensures bidders and buyers an easy and drama-free experience.\n\nPart of the auction process involves asking questions of the seller. Rarecars is here to provide prompt and complete answers within 24 hours. We encourage observers and bidders to reach out with queries rather than post assumptions or guesses. Keep in mind that some replies involve an extra inspection or a trip to a dealer, which may delay our response. We want you to have as much information as possible, which sometimes takes additional time. We appreciate your patience in these situations.\n\nSignificantly, questions should be asked before bidding, especially if the inquiry involves logistics or payment. As per BAT policy, a bid is a non-conditional commitment to purchase a vehicle. We strongly recommend getting the answers you need before promising to buy.\nRarecares welcomes friendly and polite bidders, and we do our best to encourage a stress-free buying atmosphere. While only one person can win, a cordial bidding environment for everyone is always our goal.\nWe are confident the next owner will be pleased with their purchase.\n\nGood luck with the auction!"
  },
  {
    "dateTime": "Jun 1 at 11:29 AM",
    "bidPrice": "$7,500 bid placed by Tooltime46"
  },
  {
    "dateTime": "Jun 1 at 3:41 AM",
    "bidPrice": "$7,000 bid placed by isaacb"
  },
  {
    "dateTime": "Jun 1 at 12:03 AM",
    "bidPrice": "$6,800 bid placed by Tooltime46"
  },
  {
    "dateTime": "May 31 at 10:49 PM",
    "username": "Citabria98",
    "likes": "4,339",
    "comment": "@Raquila47 There is absolutely no reason to tamper with ANY component of the emissions system of ANY contemporary automobile sold in the USA. Manufacturers have had many years to develop and dial in fuel management, ignition, and emissions systems. Cars today run great. This ain’t 1977 with the disastrous, poorly performing cars of that era. My 2015 bone stock Abarth runs great, and goes like stink. If you get one, leave it alone and just drive it. Don’t put it away hot though, drive it easy the last few miles to let things cool off a bit. Actually, this applies to any car, especially a turbocharged one."
  },
  {
    "dateTime": "May 31 at 9:54 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Hi @Deno, thanks for pointing that out. Katzkin Leather Company professionally redid the leather seats. The seat airbags were taken into consideration and still remain in the vehicle as you would expect to find them."
  },
  {
    "dateTime": "May 31 at 2:58 PM",
    "bidPrice": "$6,500 bid placed by barndt"
  },
  {
    "dateTime": "May 31 at 2:36 PM",
    "bidPrice": "$6,000 bid placed by isaacb"
  },
  {
    "dateTime": "May 31 at 11:08 AM",
    "bidPrice": "$5,300 bid placed by FASTCARGUY"
  },
  {
    "dateTime": "May 31 at 9:29 AM",
    "username": "Deno",
    "likes": "18",
    "comment": "The window sticker does not indicate that it came with leather front seats. The back seat was also redone. It is a plus.\nDo you know if there are any issues with the air bags in the front seats?"
  },
  {
    "dateTime": "May 31 at 9:11 AM",
    "bidPrice": "$5,200 bid placed by cmchen"
  },
  {
    "dateTime": "May 31 at 2:15 AM",
    "username": "isaacb",
    "likes": "8",
    "comment": "@rarecars I sent you a PM the other day. can you check your inbox and kindly get back to me. thank you!"
  },
  {
    "dateTime": "May 31 at 12:59 AM",
    "username": "Raquila47",
    "likes": "69",
    "comment": "@Racecars Appreciate the info concerning the CA being the most stringent in the nation. Trust me I am fully aware having lived there for short period. I am not concern about inspection as stated. The state I reside has no vehicle inspection, it was eliminated in 1988. I was concern only about removing the extra smog devises that would not be necessary in my area of the country, and what it would entail."
  },
  {
    "dateTime": "May 30 at 11:27 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Welcome to our weekly Bring a Trailer auction! This latest offering features an excellent 2014 Fiat Abarth with only 42k miles. This tiny but mighty vehicle embraces all the hallmark characteristics of a Fiat. Most importantly, this Abarth boasts superb condition, inside and out, and drives like it just left the factory.\nGiven this car’s background, prospective buyers will unlikely encounter a similar vehicle. Not to mention, this Abarth was regularly serviced. Adding to this Abarth’s strong appeal is an accident-free and smoke-free history, along with a recent multi-point inspection and service.\n\nWe encourage every bidder to review the accompanying photographs and test-drive videos thoroughly. These images offer a top-to-bottom look at this remarkable Abarth. We do our best to inspect for and disclose defects, including minor cosmetic blemishes. However, not all imperfections may be noticeable in the photos. Further, there may be nominal mechanical issues that have gone undetected. Through a detailed multi-point inspection and test drive, we do our utmost to uncover any non-standard factors. We will disclose anything we come across, but we want to provide a friendly reminder that the vehicle is sold without a warranty after the sale.\n\nWe’re proud of every vehicle we sell and welcome prospective buyers to visit our Silicon Valley dealership to view and inspect this notable Abarth. Don’t hesitate to contact us to arrange an inspection appointment to see this Abarth in person. We’re located five minutes from San Jose International airport.\n\nTo ensure the smoothest buying experience, all vehicles are stored in our secure facility and ready for immediate delivery or shipping. This low-mile 2015 Fiat Abarth is waiting for a new owner. We wish you successful bidding and good luck with the auction.\n\nThank you!\nJake and the Rarecars Team"
  },
  {
    "dateTime": "May 30 at 9:20 PM",
    "username": "Markindy",
    "likes": "576",
    "comment": "I have a 2013 Abarth, and I have to agree with @jcards – this little thing is an absolute blast to drive. I can also report that I have never had any problems with it. As someone who got his driver’s license in my parent’s 1978 131 Mirafiori….I know all too well Fiat’s past quality issues. The old “Fix It Again Tony” joke really doesn’t apply anymore."
  },
  {
    "dateTime": "May 30 at 9:12 PM",
    "username": "Rarecars (The Seller)",
    "likes": "1,625",
    "comment": "Hi @Raquila47, thanks for asking. California is one of the most regulated states for automobiles, so we believe that if the vehicle is able to pass in CA, then it should pass nearly anywhere else."
  },
  {
    "dateTime": "May 30 at 5:00 PM",
    "username": "Raquila47",
    "likes": "69",
    "comment": "@GBRBIll I would agree that with you of today’s (newer) world cars. I wouldn’t think it would apply to this Fiat as it is a 2014. But I could be in error. I will Google to see if manufactures were in fact if manufactures were applying the one world concept 9 years ago. Hey! Thanks for the quit reply/info."
  },
  {
    "dateTime": "May 30 at 10:45 AM",
    "username": "GBRBIll",
    "likes": "3,148",
    "comment": "@Raquila47 – I was under the impression that most if not all cars sold here now are 50 state legal and there isn’t any difference between them. As a matter of fact, I was under the impression that manufacturers are building one world cars now. Makes their lives much easier. If I am completely wrong, I would recommend documenting and saving all of the bits so if you decide to sell it to someone where there are emission requirements, you will have a larger market.\nHaven driven several of these over the years, they are not lacking in performance so I’m not sure you would gain much by fussing with it.\nNice car!"
  },
  {
    "dateTime": "May 29 at 10:58 PM",
    "username": "Raquila47",
    "likes": "69",
    "comment": "In the state I live there is no car inspections. What would be the difficulty of removing the CA smog controls?"
  },
  {
    "dateTime": "May 29 at 8:54 PM",
    "username": "Jcards",
    "likes": "196",
    "comment": "I just bought a 2016 Abarth cabrio with a 5 speed to go with a few other, far more expensive toys and I have to say, I just might like driving this thing more than most others in my garage. There’s something about this car that makes you look forward to turning the key every time…the sound, the dimensions, the Italian driving position – it’s like my vintage Alfa without the headaches!"
  },
  {
    "dateTime": "May 29 at 7:55 PM",
    "username": "TheOMDude",
    "likes": "6,156",
    "comment": "The rare fun car here that I might be able to sell as a “cute little car that gets good gas mileage” to my wife."
  },
  {
    "dateTime": "May 29 at 5:56 PM",
    "bidPrice": "$5,000 bid placed by isaacb"
  },
  {
    "dateTime": "May 29 at 3:04 PM",
    "bidPrice": "$4,200 bid placed by aintgotnogasinit"
  },
  {
    "dateTime": "May 29 at 11:53 AM",
    "bidPrice": "$500 bid placed by isaacb"
  }
]